Revit 2027 API
ContinuousRailType.ProfileId Property
 The id of the profile of the rail
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProfileId { get; set; }
Public Property ProfileId As ElementId
	Get
	Set
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ProfileId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The profileId is neither a valid element id nor invalidElementId. -or- When setting this property: The profileId is not a valid profile symbol for continuous rail.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace